app/controllers/quiz_data_controller.rb

  def create
    @quiz_data = current_user.quiz_data.build(quiz_data_params)

    if @quiz_data.save
---
INSERT INTO "quiz_data" ("founder_name", "email", "country", "gender", "race_of_founder", "text_box", "conscious_beauty_credentials", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def find_quiz_data
    @quiz_data = current_user.quiz_data.find_by(id: params[:id])
---
SELECT "quiz_data".* FROM "quiz_data" WHERE "quiz_data"."user_id" = $1  [["user_id", 2]]